"""
출력 명령어
"""

# 연산자
print(9 + 6)  # 15			// 덧셈
print(9 - 6)  # 3				// 뺄셈
print(9 * 6)  # 54			// 곱셈
print(9 / 6)  # 1.5			// 나눗셈
print(9 // 6)  # 1			// 나눗셈 몫
print(9 % 6)  # 3				// 나눗셈 나머지
print(9**6)  # 531441		// 제곱

# 연산자 연결
print(14 + 31)  # 45
print("파이썬" + "프로그래밍")  # 파이썬프로그래밍

print(14, 31)  # 14 31
print("파이썬", "프로그래밍")  # 파이썬 프로그래밍

# print("파이썬" + 3)	# error
# print("파이썬" - 3)	# error
print("파이썬" * 3)  # 파이썬파이썬파이썬
# print("파이썬" / 3)	# error


"""
입력 명령어
"""

input("입력: ")  # 입력: @

print(input("아이디: ") + "님, 가입을 환엽합니다!")  # @님, 가입을 환엽합니다!


"""
Self Check
"""

# 1
print("무궁화 꽃이 피었습니다" * 3)

# 3
print(input("닉네임을 입력해 주세요: ") + "님 안녕하세요")
