"""
일반
"""

eng = {"break": "깨어지다", "bring": "가져오다", "brush": "붓", "brave": "용감한"}

print(
    eng
)  # {'break': '깨어지다', 'bring': '가져오다', 'brush': '붓', 'brave': '용감한'}
print(eng["break"])  # 깨어지다


"""
키 중복 사용
"""
eng = {
    "break": "깨어지다",
    "bring": "가져오다",
    "brush": "붓",
    "brush": "빗",  # 키를 중복해서 넣으면 마지막 값만 남고 나머지 값은 사라짐
    "brave": "용감한",
}
print(eng["brush"])  # 빗


"""
값
"""
eng = {"break": ["깨어지다", "부서지다"], "bring": "가져오다", "brush": ["붓", "빗"]}
print(eng["break"])  # ['깨어지다', '부서지다']


"""
값 변경
"""
menu = {"김밥": 2500, "참치김밥": 3500, "라면": 3000, "치즈라면": 4000}
menu["참치김밥"] = 3000
print(menu)  # {'김밥': 2500, '참치김밥': 3000, '라면': 3000, '치즈라면': 4000}


"""
추가
"""
menu = {"김밥": 2500, "참치김밥": 3500, "라면": 3000, "치즈라면": 4000}
menu["돈가스"] = 6000
print(
    menu
)  # {'김밥': 2500, '참치김밥': 3500, '라면': 3000, '치즈라면': 4000, '돈가스': 6000}


"""
삭제
"""
menu = {"김밥": 2500, "참치김밥": 3500, "라면": 3000, "치즈라면": 4000}
del menu["치즈라면"]
print(menu)  # {'김밥': 2500, '참치김밥': 3500, '라면': 3000}


"""
.keys()
"""
mart = {"과자": 1500, "아이스크림": 1700, "휴지": 4800, "고기": 10500, "우유": 2600}
print(mart.keys())  # dict_keys(['과자', '아이스크림', '휴지', '고기', '우유'])


"""
.values()
"""
mart = {"과자": 1500, "아이스크림": 1700, "휴지": 4800, "고기": 10500, "우유": 2600}
print(mart.values())  # dict_values([1500, 1700, 4800, 10500, 2600])


"""
list()
"""
mart = {"과자": 1500, "아이스크림": 1700, "휴지": 4800, "고기": 10500, "우유": 2600}
print(list(mart.keys()))  # ['과자', '아이스크림', '휴지', '고기', '우유']


"""
.items()
"""
mart = {"과자": 1500, "아이스크림": 1700, "휴지": 4800, "고기": 10500, "우유": 2600}
print(
    mart.items()
)  # dict_items([('과자', 1500), ('아이스크림', 1700), ('휴지', 4800), ('고기', 10500), ('우유', 2600)])


"""
.sorted(x.keys()) = .sorted(x)
"""
mart = {"과자": 1500, "아이스크림": 1700, "휴지": 4800, "고기": 10500, "우유": 2600}
print(sorted(mart.keys()))  # ['고기', '과자', '아이스크림', '우유', '휴지']
print(
    sorted(mart.keys(), reverse=True)
)  # ['휴지', '우유', '아이스크림', '과자', '고기']
print(sorted(mart.keys())[:2])  # ['고기', '과자']

"""
key=operator.itemgetter(0 or 1)	// key=는 정렬 기준	// 0: key, 1: value
"""
import operator  # 계산을 도와주는 다양한 명령어가 포함

mart = {"과자": 1500, "아이스크림": 1700, "휴지": 4800, "고기": 10500, "우유": 2600}
print(
    sorted(mart.items(), key=operator.itemgetter(0))
)  # [('고기', 10500), ('과자', 1500), ('아이스크림', 1700), ('우유', 2600), ('휴지', 4800)]
print(
    sorted(mart.items(), key=operator.itemgetter(1))
)  # [('과자', 1500), ('아이스크림', 1700), ('우유', 2600), ('휴지', 4800), ('고기', 10500)]


"""
dict()	// items()로 정렬한 결과만 딕셔너리로 변환할 수 있음
"""
mart = {"과자": 1500, "아이스크림": 1700, "휴지": 4800, "고기": 10500, "우유": 2600}
mart = dict(sorted(mart.items()))
print(
    mart
)  # {'고기': 10500, '과자': 1500, '아이스크림': 1700, '우유': 2600, '휴지': 4800}


"""
제어구조 사용
"""
midterm = {"도윤": 43, "하윤": 82, "시우": 76, "지유": 61, "주원": 94}
student = input("학생 입력: ")
if student in midterm.keys():
    print(midterm[student], "점입니다.")
else:
    print("해당 학생잉 없습니다.")

for k in midterm.keys():
    print(k, end=" ")  # 도윤 하윤 시우 지유 주원
print("\n")


"""
반복문 - 키, 값 같이 출력
"""
midterm = {"도윤": 43, "하윤": 82, "시우": 76, "지유": 61, "주원": 94}

# 방법 1
for k in midterm.keys():
    print(k, midterm[k], end=" ")  # 도윤 43 하윤 82 시우 76 지유 61 주원 94
print("\n")

# 방법 2
for i in midterm.items():
    print(
        i, end=" "
    )  # ('도윤', 43) ('하윤', 82) ('시우', 76) ('지유', 61) ('주원', 94)
print("\n")

# 방법 3
for k, v in midterm.items():
    print(k, v, end=" ")  # 도윤 43 하윤 82 시우 76 지유 61 주원 94
print("\n")


"""
중첩 제어구조
"""
midterm = {"도윤": 43, "하윤": 82, "시우": 76, "지유": 61, "주원": 94}

for k, v in midterm.items():
    if v >= 70:
        print(k, v, end=" ")  # 하윤 82 시우 76 주원 94
print("\n")


"""
딕셔러닝명만 사용할 경우
"""
midterm = {"도윤": 43, "하윤": 82, "시우": 76, "지유": 61, "주원": 94}
for m in midterm:
    print(m, end=" ")  # 도윤 하윤 시우 지유 주원
